#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

data.aws_iam_role.name: Reading...
data.aws_vpcs.selected: Reading...
data.aws_iam_role.name: Read complete after 0s [id=LabRole]
data.aws_vpcs.selected: Read complete after 0s [id=us-east-1]
data.aws_subnets.selected: Reading...
data.aws_subnets.selected: Read complete after 0s [id=us-east-1]
data.aws_subnet.selected["subnet-0541c8f899878e624"]: Reading...
data.aws_subnet.selected["subnet-03c924783e450d9a7"]: Reading...
data.aws_subnet.selected["subnet-0e6760268f5ed6744"]: Reading...
data.aws_subnet.selected["subnet-0d75bbce12c922953"]: Reading...
data.aws_subnet.selected["subnet-033e3aae550907db6"]: Reading...
data.aws_subnet.selected["subnet-02c55b6855ff756cc"]: Reading...
data.aws_subnet.selected["subnet-0e6760268f5ed6744"]: Read complete after 0s [id=subnet-0e6760268f5ed6744]
data.aws_subnet.selected["subnet-03c924783e450d9a7"]: Read complete after 0s [id=subnet-03c924783e450d9a7]
data.aws_subnet.selected["subnet-033e3aae550907db6"]: Read complete after 0s [id=subnet-033e3aae550907db6]
data.aws_subnet.selected["subnet-0d75bbce12c922953"]: Read complete after 0s [id=subnet-0d75bbce12c922953]
data.aws_subnet.selected["subnet-0541c8f899878e624"]: Read complete after 0s [id=subnet-0541c8f899878e624]
data.aws_subnet.selected["subnet-02c55b6855ff756cc"]: Read complete after 0s [id=subnet-02c55b6855ff756cc]
aws_eks_cluster.eks-techlanches: Refreshing state... [id=eks-techlanches]
aws_eks_addon.aws_ebs_csi_driver: Refreshing state... [id=eks-techlanches:aws-ebs-csi-driver]
aws_eks_node_group.techlanches-node: Refreshing state... [id=eks-techlanches:techlanches-node]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.aws_ebs_csi_driver will be created
  + resource "aws_eks_addon" "aws_ebs_csi_driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.28.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "NONE"
      + tags_all                    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @aoliveiramateus, Action: `pull_request`*